УчетВУправляющихДляГит1/src/InformationRegisters/МетодыОпределенияПрямыхРасходовПроизводстваВНУ/МетодыОпределенияПрямыхРасходовПроизводстваВНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МетодыОпределенияПрямыхРасходовПроизводстваВНУ</name>
  <dimensions>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасходовНУ</name>
    <type>
      <types>EnumRef.ВидыРасходовНУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <comment>Счет учета прямых расходов</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорСчет</name>
    <comment>Корреспондирующий счет</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыРасходовНУ/ВидыРасходовНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасходовНУ</name>
  <enumValues>
    <name>АмортизационнаяПремия</name>
    <comment>Амортизационная премия (п. 1.1 ст. 259 НК РФ)</comment>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
  </enumValues>
  <enumValues>
    <name>АрендаФедеральногоИМуниципальногоИмущества</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахование</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</name>
  </enumValues>
  <enumValues>
    <name>ЕСН</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>МатериальныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВЦеляхНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>НИОКРПоПеречнюПравительстваРФ</name>
  </enumValues>
  <enumValues>
    <name>ОбязательноеИДобровольноеСтрахованиеИмущества</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаРекламуНормируемые</name>
  </enumValues>
  <enumValues>
    <name>РемонтОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/InformationRegisters/МетодыОпределенияПрямыхРасходовПроизводстваВНУ/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	Счет20 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Счет23 = Планысчетов.Хозрасчетный.ВспомогательныеПроизводства;

	ВидыРасходов = Перечисления.ВидыРасходовНУ;
	ПланСчетов   = ПланыСчетов.Хозрасчетный;
	
	ДобавитьЗапись(ВидыРасходов.МатериальныеРасходы);
	ДобавитьЗапись(ВидыРасходов.Амортизация);
	ДобавитьЗапись(ВидыРасходов.ОплатаТруда);

	СтраховыеВзносы = Перечисления.ВидыРасходовНУ.СтраховыеВзносы;

	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ФСС);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ФСС);

	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ПФР_страх);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ПФР_страх);
	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ПФР_нак);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ПФР_нак);
	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ПФР_доп);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ПФР_доп);
	
	Для Каждого СчетВзносов Из РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.СчетаВзносовС2014Года() Цикл
		ДобавитьЗапись(СтраховыеВзносы, Счет20, СчетВзносов);
		ДобавитьЗапись(СтраховыеВзносы, Счет23, СчетВзносов);
	КонецЦикла;
		
	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ФФОМС);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ФФОМС);
	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ТФОМС);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ТФОМС);
	ДобавитьЗапись(СтраховыеВзносы, Счет20, ПланСчетов.ОценочныеОбязательстваПостраховымВзносам);
	ДобавитьЗапись(СтраховыеВзносы, Счет23, ПланСчетов.ОценочныеОбязательстваПостраховымВзносам);
	
	ПрочиеРасходы = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
	
	ДобавитьЗапись(ПрочиеРасходы, Счет20, ПланСчетов.ФСС_НСиПЗ);
	ДобавитьЗапись(ПрочиеРасходы, Счет23, ПланСчетов.ФСС_НСиПЗ);
	ДобавитьЗапись(ПрочиеРасходы, Счет20, ПланСчетов.ОценочныеОбязательстваПостраховымВзносам);
	ДобавитьЗапись(ПрочиеРасходы, Счет23, ПланСчетов.ОценочныеОбязательстваПостраховымВзносам);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗапрещенныеВидыРасходовНУ = РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.ЗапрещенныеВидыРасходовНУ();
	
	ОшибкиЗапрещенныеВидыРасходовНУ = Новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗапрещенныеВидыРасходовНУ.Найти(Запись.ВидРасходовНУ) <> Неопределено Тогда
			ОшибкиЗапрещенныеВидыРасходовНУ.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Если ОшибкиЗапрещенныеВидыРасходовНУ.Количество() > 0 Тогда
	
		ОписаниеКлючаЗаписи = Новый Структура; // Для навигации в сообщении об ошибке
		Для Каждого Измерение Из Метаданные.РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Измерения Цикл
			ОписаниеКлючаЗаписи.Вставить(Измерение.Имя);
		КонецЦикла;
		
		Для Каждого Ошибка Из ОшибкиЗапрещенныеВидыРасходовНУ Цикл
			
			ТекстСообщения = НСтр("ru = 'Расходы с видом ""%1"" не могут быть прямыми'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ошибка.ВидРасходовНУ);
			
			ЗаполнитьЗначенияСвойств(ОписаниеКлючаЗаписи, Ошибка);
			КлючЗаписи = РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.СоздатьКлючЗаписи(ОписаниеКлючаЗаписи);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючЗаписи, , , Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = ОсновнаяОрганизация;
		КонецЕсли;
		
		Если НачалоГода(Запись.ПериодДействия) <> Запись.ПериодДействия Тогда
			// В регистре допускаются записи только на начало года.
			// При этом допускаются записи на такое начало года, которое не является началом налогового периода - 
			// см. ПериодДействующейНастройки()
			Запись.ПериодДействия = НачалоГода(Запись.ПериодДействия);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	
	// Заполнять можем только, если установлен отбор по организации и периоду 
	// и не установлены другие отборы
	Организация = Неопределено;
	Если Не УстановленОтбор("Организация", Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодДействия = Неопределено;
	Если Не УстановленОтбор("ПериодДействия", ПериодДействия) Тогда
		Возврат;
	КонецЕсли;
	
	Измерения = Метаданные.РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Измерения;
	Для Каждого Измерение Из Измерения Цикл
		
		Если Измерение = Измерения.Организация Или Измерение = Измерения.ПериодДействия Тогда
			Продолжить;
		КонецЕсли;
		
		Если УстановленОтбор(Измерение.Имя) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПериодДействия <> НачалоГода(ПериодДействия) Тогда
		// В регистре допускаются записи только на начало года.
		// При этом допускаются записи на такое начало года, которое не является началом налогового периода - 
		// см. ПериодДействующейНастройки()
		Возврат;
	КонецЕсли;
	
	// Определим, какими данными будем заполнять
	ВариантПоУмолчанию      = "ПоУмолчанию";
	ВариантПредыдущийПериод = "ПредыдущийПериод";
	
	ИсточникДанных = ВариантПоУмолчанию;
	ДанныеПредыдущегоГода = Неопределено;
	
	Если ДанныеЗаполнения = ВариантПоУмолчанию Или ДанныеЗаполнения = ВариантПредыдущийПериод Тогда
		ИсточникДанных = ДанныеЗаполнения;
	Иначе
		// Нет ли данных за предыдущий период?
		ДанныеПредыдущегоГода = ДанныеПредыдущегоГода(ПериодДействия, Организация);
		Если ДанныеПредыдущегоГода <> Неопределено Тогда
			ИсточникДанных = ВариантПредыдущийПериод;
		КонецЕсли;
	КонецЕсли;
	
	Если ИсточникДанных = ВариантПоУмолчанию Тогда
		ЗаполнитьПоУмолчанию();
	Иначе
		// Заполним данными предыдущего года
		Если ДанныеПредыдущегоГода = Неопределено Тогда
			ДанныеПредыдущегоГода = ДанныеПредыдущегоГода(ПериодДействия, Организация);
		КонецЕсли;
		Если ДанныеПредыдущегоГода = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Загрузить(ДанныеПредыдущегоГода);
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
		Строка.Организация    = Организация;
		Строка.ПериодДействия = ПериодДействия;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеПредыдущегоГода(ПериодДействия, Организация)
	
	// В регистре допускаются записи только на начало года.
	// При этом допускаются записи на такое начало года, которое не является началом налогового периода - 
	// см. ПериодДействующейНастройки()
	// В ПредыдущийГод следует передавать начало года.
	ПредыдущийГод = ДобавитьМесяц(ПериодДействия, -12);
	
	ПериодПредыдущейНастройки = РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.ПериодДействующейНастройки(
		ПредыдущийГод,
		Организация);
		
	Если Не ЗначениеЗаполнено(ПериодПредыдущейНастройки) Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДанныеРегистраСведений(Организация, ПериодПредыдущейНастройки);
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение

Функция ДанныеРегистраСведений(Организация, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	// В регистре допускаются записи только на начало года.
	// При этом допускаются записи на такое начало года, которое не является началом налогового периода - 
	// см. ПериодДействующейНастройки()
	Запрос.УстановитьПараметр("Период",      НачалоГода(Период));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ВидРасходовНУ,
	|	Настройки.Подразделение,
	|	Настройки.Счет,
	|	Настройки.КорСчет,
	|	Настройки.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ КАК Настройки
	|ГДЕ
	|	Настройки.ПериодДействия = &Период
	|	И Настройки.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;

КонецФункции

Процедура ДобавитьЗапись(ВидРасходовНУ, СчетДебета = Неопределено,СчетКредита = Неопределено)

	НоваяЗапись = Добавить();
	НоваяЗапись.ВидРасходовНУ  = ВидРасходовНУ;
	НоваяЗапись.Счет           = СчетДебета;
	НоваяЗапись.КорСчет        = СчетКредита;

КонецПроцедуры

Функция УстановленОтбор(Знач Имя, Значение = Неопределено)
	
	ЭлементОтбора = Отбор.Найти(Имя);
	Если ЭлементОтбора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЭлементОтбора.Использование Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если ЭлементОтбора.ВидСравнения <> ВидСравнения.Равно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭлементОтбора.Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Значение = ЭлементОтбора.Значение;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочее

#КонецЕсли
